////////////////////////Нарисуйте ромб

//          1
//         121
//        12321
//       1234321
//      123454321
//     12345654321
//    1234567654321
//   123456787654321
//  12345678987654321
// 1234567890987654321
//  12345678987654321
//   123456787654321
//    1234567654321
//     12345654321
//      123454321
//       1234321
//        12321
//         121
//          1

let n = 10;
let newStr = '';
for(let i = 1; i <= n; i++){
    newStr = newStr + ' '.repeat(n - i)
    for(let j = 1; j <= i; j++){
    newStr = newStr + j % 10; 
    }
//newStr += `\n`                 ////////////// razryv stroki
//}
//for(let i = 1; i <= n; i++){
    
    for(let j = i - 1; j >= 1; j--){
    newStr = newStr + j % 10; 
    }
newStr += `\n`                 ////////////// razryv stroki
}
for(let i = 1; i <= n; i++){
    newStr = newStr + ' '.repeat(i - 1)
    for(let j = 1; j <= n + 1 - i; j++){
    newStr = newStr + j % 10; 
    }
//newStr += `\n`
//}
//for(let i = 1; i <= n; i++){
    
    for(let j = n - i; j >= 1; j--){
    newStr = newStr + j % 10; 
    }
newStr += `\n`
}     
console.log(newStr);



// 2 Нарисуйте елочку
//     *
//    ***
//   *****
//  *******
// *********
/////////////////////////////////////1 variant
// let num = 5;
// for(let i = 0; i < num; i++){
//     let str = '';
   
// for(let j = 0; j < num - i; j++){
//     str = str + ' '; 
// }

// for(let k = 0; k < i; k++){
//     str = str + '*';
// }
// str = str + '*';
// for(let l = 0; l < i; l++){
//     str = str + '*';
// }
// console.log(str);
//}

///////////////////////////////////////////////////второй вариант
// let row = 5;
// let str = '';
// for(let i = 0; i < row; i++){
//     for(let j = i; j < row - 1; j++){
//         str += ' ';
//     }
//     for(let k = 0; k < 2 * i + 1; k++){ ///////////////////////////////////считаем пробелы в начале строки
//         str = str + '*'
//     }
//     str += `\n`  ///////////////////// разрыв строки - переход на следующую строку
// }
// console.log(str)
////////////////////////////////////////////////////////////3 variant
// let sum = 1;
// for(let i = 1; i <= row; i++){
//     str += ' '.repeat(row - i) + '*'.repeat(sum) + `\n`
//     sum += 2; 
// }
// console.log(str)
//////////////////////////////////////////////////////2 вариант

// 3. Нарисуйте пирамидку
// 1 
// 2 6 
// 3 7 10 
// 4 8 11 13 
// 5 9 12 14 15
/////////////////////////////////////////// 1 variant
let row = 5;
let str = '';
// for(let i = 1; i <= row; i++){
//  let num = i; 
// for(let j = 1; j <= i; j++){
//        str = str + num + ' ';
//        num = num + (row - j);
//     }   
// str = str + `\n`;
// }
// console.log(str);
//////////////////////////////////////////////// 2 variant
for (let i = 1; i <= row; i++){
    let num = i;
    for(let j = 1; j <= i; j++){
        str = str + num + ' ';
        num = num + (row - j)
    }
    str += `\n`
}
console.log(str)

// 4. Закрепление- Продумайте код для создания сэндвичей с 3-мя начинками и выставите цену в зависимости от вида начинки. Используйте while and do.. while loops
//.......................... рисуем ромб
//    1
//   12
//  123
// 1234
//12345
//1
//12
//123
//1234
//12345
    // 1
    // 11
   
// let row = 10;
// let str = '';
// for (let i = 1; i <= row; i++) {
//     str += ' '.repeat(row - i)  ////////////////////////////////добавляем пробелы
//     for(let j = 1; j <= i; j++){
//         str = str + j % 10;
//     }
//     for(let k = i - 1; k >= 1; k--){ ////////////////////// переворачиваем цифры
//         str += k % 10;
//     }

//     str = str + `\n`; //////// перенос строки  
// }
// ///////////////////////////////рижняя часть
// for (let i = row - 1; i >= 1; i--) {
//     str += ' '.repeat(row - i)  ////////////////////////////////добавляем пробелы
//     for(let j = 1; j <= i; j++){
//         str = str + j % 10;
//     }
//     for(let k = i - 1; k >= 1; k--){ ////////////////////// переворачиваем цифры
//         str += k % 10;
//     }
//     str = str + `\n`; //////// перенос строки  
// }
// console.log(str)